In [4]:
import numpy as np
import pandas as pd

In [ ]:
df = pd.read_csv('cust_det.csv')

In [ ]:
df

In [ ]:
m2m = df.loc[df['contract_type'] == 0]

In [ ]:
df.groupby(['contract_type','is_senior_citizen']).count()

In [ ]:
df = pd.read_csv('cust_details.csv')

In [ ]:
df

In [5]:
df = pd.read_csv('copy.csv')

In [7]:
df.tenure

0        9.044207
1        9.055092
2        3.800406
3       12.631122
4        3.187128
          ...
7044    13.470535
7045    22.017626
7046     1.843936
7047    68.204127
7048    62.840678
Name: tenure, Length: 7049, dtype: float64

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7049 entries, 0 to 7048
Data columns (total 29 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   customer_id             7043 non-null   object
 1   gender                  7049 non-null   object
 2   is_senior_citizen       7049 non-null   int64
 3   partner                 7049 non-null   object
 4   dependents              7049 non-null   object
 5   phone_service           7049 non-null   int64
 6   internet_service        7049 non-null   int64
 7   contract_type           7049 non-null   int64
 8   payment_type            7049 non-null   object
 9   monthly_charges         7049 non-null   float64
 10  total_charges           7038 non-null   float64
 11  churn                   7049 non-null   object
 12  tenure                  7049 non-null   float64
 13  tenure-rounded          7049 non-null   float64
 14  is_female               7049 non-null   bool
 15  has_churned             7049 non-null   bool
 16  has_phone               7049 non-null   bool
 17  has_internet            7049 non-null   bool
 18  has_phone_and_internet  7049 non-null   bool
 19  partner_dependents      7049 non-null   int64
 20  start_date              7049 non-null   object
 21  avg_mon_charges         7049 non-null   object
 22  Contract_type           7049 non-null   object
 23  Phone_service           7049 non-null   object
 24  Internet_service        7049 non-null   object
 25  is_ten_less12           7049 non-null   bool
 26  Pivot Info              7049 non-null   object
 27  Unnamed: 27             0 non-null      float64
 28  Unnamed: 28             3 non-null      object
dtypes: bool(6), float64(5), int64(5), object(13)
memory usage: 1.3+ MB

In [11]:
df.groupby(['Contract_type']).monthly_charges.agg(['mean'])

                     mean
Contract_type
1 Year          65.061721
2 Year          60.722422
Month-to-Month  66.389229

In [12]:
df.groupby(['Contract_type']).tenure.agg(['mean'])

                     mean
Contract_type
1 Year          42.029675
2 Year          56.785700
Month-to-Month  18.019748

In [20]:
df.groupby(['Contract_type']).has_phone_and_internet.agg(['count'])

                count
Contract_type
1 Year           1476
2 Year           1697
Month-to-Month   3876

In [21]:
df.Contract_type.value_counts()

Month-to-Month    3876
2 Year            1697
1 Year            1476
Name: Contract_type, dtype: int64

In [25]:
df.groupby(['Contract_type','is_senior_citizen']).agg(['count'])

                                 customer_id gender partner dependents  \
                                       count  count   count      count
Contract_type  is_senior_citizen
1 Year         0                        1285   1286    1286       1286
               1                         190    190     190        190
2 Year         0                        1550   1552    1552       1552
               1                         145    145     145        145
Month-to-Month 0                        3066   3069    3069       3069
               1                         807    807     807        807

                                 phone_service internet_service contract_type  \
                                         count            count         count
Contract_type  is_senior_citizen
1 Year         0                          1286             1286          1286
               1                           190              190           190
2 Year         0                          1552             1552          1552
               1                           145              145           145
Month-to-Month 0                          3069             3069          3069
               1                           807              807           807

                                 payment_type monthly_charges total_charges  \
                                        count           count         count
Contract_type  is_senior_citizen
1 Year         0                         1286            1286          1285
               1                          190             190           190
2 Year         0                         1552            1552          1542
               1                          145             145           145
Month-to-Month 0                         3069            3069          3069
               1                          807             807           807

                                  ... partner_dependents start_date  \
                                  ...              count      count
Contract_type  is_senior_citizen  ...
1 Year         0                  ...               1286       1286
               1                  ...                190        190
2 Year         0                  ...               1552       1552
               1                  ...                145        145
Month-to-Month 0                  ...               3069       3069
               1                  ...                807        807

                                 avg_mon_charges Phone_service  \
                                           count         count
Contract_type  is_senior_citizen
1 Year         0                            1286          1286
               1                             190           190
2 Year         0                            1552          1552
               1                             145           145
Month-to-Month 0                            3069          3069
               1                             807           807

                                 Internet_service is_ten_less12 Pivot Info  \
                                            count         count      count
Contract_type  is_senior_citizen
1 Year         0                             1286          1286       1286
               1                              190           190        190
2 Year         0                             1552          1552       1552
               1                              145           145        145
Month-to-Month 0                             3069          3069       3069
               1                              807           807        807

                                 Unnamed: 27 Unnamed: 28 count
                                       count       count count
Contract_type  is_senior_citizen
1 Year         0                           0           0     0
               1                           0           0     0
2 Year         0                           0           1     0
               1                           0           1     0
Month-to-Month 0                           0           0     0
               1                           0           1     0

[6 rows x 28 columns]

In [28]:
df.groupby(['Contract_type','gender']).agg(['count'])

                      customer_id is_senior_citizen partner dependents  \
                            count             count   count      count
Contract_type  gender
1 Year         Female         718               719     719        719
               Male           757               757     757        757
2 Year         Female         846               846     846        846
               Male           849               851     851        851
Month-to-Month Female        1925              1926    1926       1926
               Male          1948              1950    1950       1950

                      phone_service internet_service contract_type  \
                              count            count         count
Contract_type  gender
1 Year         Female           719              719           719
               Male             757              757           757
2 Year         Female           846              846           846
               Male             851              851           851
Month-to-Month Female          1926             1926          1926
               Male            1950             1950          1950

                      payment_type monthly_charges total_charges  ...  \
                             count           count         count  ...
Contract_type  gender                                             ...
1 Year         Female          719             719           719  ...
               Male            757             757           756  ...
2 Year         Female          846             846           841  ...
               Male            851             851           846  ...
Month-to-Month Female         1926            1926          1926  ...
               Male           1950            1950          1950  ...

                      partner_dependents start_date avg_mon_charges  \
                                   count      count           count
Contract_type  gender
1 Year         Female                719        719             719
               Male                  757        757             757
2 Year         Female                846        846             846
               Male                  851        851             851
Month-to-Month Female               1926       1926            1926
               Male                 1950       1950            1950

                      Phone_service Internet_service is_ten_less12 Pivot Info  \
                              count            count         count      count
Contract_type  gender
1 Year         Female           719              719           719        719
               Male             757              757           757        757
2 Year         Female           846              846           846        846
               Male             851              851           851        851
Month-to-Month Female          1926             1926          1926       1926
               Male            1950             1950          1950       1950

                      Unnamed: 27 Unnamed: 28 count
                            count       count count
Contract_type  gender
1 Year         Female           0           0     0
               Male             0           0     0
2 Year         Female           0           1     0
               Male             0           1     0
Month-to-Month Female           0           1     0
               Male             0           0     0

[6 rows x 28 columns]

In [29]:
df.groupby(['Contract_type']).has_churned.agg(['mean'])

                    mean
Contract_type
1 Year          0.112466
2 Year          0.028285
Month-to-Month  0.427245

In [30]:
df.payment_type.head()

0        Mailed check
1        Mailed check
2    Electronic check
3    Electronic check
4        Mailed check
Name: payment_type, dtype: object

In [35]:
df.groupby(['Contract_type','payment_type']).customer_id.agg(['count'])

                                          count
Contract_type  payment_type
1 Year         Bank transfer (automatic)    393
               Credit card (automatic)      399
               Electronic check             347
               Mailed check                 336
2 Year         Bank transfer (automatic)    565
               Credit card (automatic)      582
               Electronic check             167
               Mailed check                 381
Month-to-Month Bank transfer (automatic)    589
               Credit card (automatic)      543
               Electronic check            1849
               Mailed check                 892

In [37]:
df.groupby(['Contract_type']).has_churned.agg('count')

Contract_type
1 Year            1476
2 Year            1697
Month-to-Month    3876
Name: has_churned, dtype: int64

In [38]:
df.has_churned.value_counts()

False    5179
True     1870
Name: has_churned, dtype: int64

In [45]:
churned = df[ df.has_churned == True]

In [55]:
churned_m2m = df[df.Contract_type == '0']

In [56]:
churned_m2m

Empty DataFrame
Columns: [customer_id, gender, is_senior_citizen, partner, dependents, phone_service, internet_service, contract_type, payment_type, monthly_charges, total_charges, churn, tenure, tenure-rounded, is_female, has_churned, has_phone, has_internet, has_phone_and_internet, partner_dependents, start_date, avg_mon_charges, Contract_type, Phone_service, Internet_service, is_ten_less12, Pivot Info, Unnamed: 27, Unnamed: 28, count]
Index: []

[0 rows x 30 columns]

In [57]:
df.groupby(['Contract_type','has_churned']).agg('count')

                            customer_id  gender  is_senior_citizen  partner  \
Contract_type  has_churned
1 Year         False               1309    1310               1310     1310
               True                 166     166                166      166
2 Year         False               1647    1649               1649     1649
               True                  48      48                 48       48
Month-to-Month False               2219    2220               2220     2220
               True                1654    1656               1656     1656

                            dependents  phone_service  internet_service  \
Contract_type  has_churned
1 Year         False              1310           1310              1310
               True                166            166               166
2 Year         False              1649           1649              1649
               True                 48             48                48
Month-to-Month False              2220           2220              2220
               True               1656           1656              1656

                            contract_type  payment_type  monthly_charges  ...  \
Contract_type  has_churned                                                ...
1 Year         False                 1310          1310             1310  ...
               True                   166           166              166  ...
2 Year         False                 1649          1649             1649  ...
               True                    48            48               48  ...
Month-to-Month False                 2220          2220             2220  ...
               True                  1656          1656             1656  ...

                            partner_dependents  start_date  avg_mon_charges  \
Contract_type  has_churned
1 Year         False                      1310        1310             1310
               True                        166         166              166
2 Year         False                      1649        1649             1649
               True                         48          48               48
Month-to-Month False                      2220        2220             2220
               True                       1656        1656             1656

                            Phone_service  Internet_service  is_ten_less12  \
Contract_type  has_churned
1 Year         False                 1310              1310           1310
               True                   166               166            166
2 Year         False                 1649              1649           1649
               True                    48                48             48
Month-to-Month False                 2220              2220           2220
               True                  1656              1656           1656

                            Pivot Info  Unnamed: 27  Unnamed: 28  count
Contract_type  has_churned
1 Year         False              1310            0            0      0
               True                166            0            0      0
2 Year         False              1649            0            2      0
               True                 48            0            0      0
Month-to-Month False              2220            0            1      0
               True               1656            0            0      0

[6 rows x 28 columns]